 using System;
 //2. Написать метод подсчета количества цифр числа.

Console.WriteLine ("Впиши число "); 
string number = Console.ReadLine();

Console.WriteLine ($"Количество символов: {number.Length}");