 using System;
 //2. Написать метод подсчета количества цифр числа.

Console.WriteLine ("Впиши число "); 
string number = ToString ().Length;
